app/views/entidades/_form.html.erb

SELECT "ramos".* FROM "ramos"  ORDER BY "ramos"."nome" ASC
---
    <div>
      <%= f.collection_select :ramo_id, Ramo.order(:nome),:id,:nome, {prompt: "Selecione"}, {class: "form-control"} %>