app/controllers/entidades_controller.rb

SELECT "entidades".* FROM "entidades"
---
  def index
    @entidades = Entidade.all

INSERT INTO "entidades" ("nome", "cnpj", "latitude", "longitude", "estado", "cidade", "bairro", "cep", "rua", "numero", "telefone", "contato", "status", "ramo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
  def create
    @entidade = Entidade.new(entidade_params)
    @entidade.status = 1

    respond_to do |format|
      if @entidade.save

SELECT  "entidades".* FROM "entidades" WHERE "entidades"."id" = $1 LIMIT 1  [["id", nil]]
---
    def set_entidade
      @entidade = Entidade.find(params[:id])