app/controllers/horarios_controller.rb

  def create
    @weeks = week
    @horario = Horario.new(horario_params)

    if (current_user.tipo.eql? 2)
      @horario.entidade_id = current_user.entidade_id
    end

    respond_to do |format|
      if @horario.save
---
INSERT INTO "horarios" ("dia_semana", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["dia_semana", "#"], ["created_at", "2016-03-27 01:27:58.102126"], ["updated_at", "2016-03-27 01:27:58.102126"]]

  def update
    if (current_user.tipo.eql? 2)
      @horario.entidade_id = current_user.entidade_id
    end

    respond_to do |format|
      if @horario.update(horario_params)
---
UPDATE "horarios" SET "dia_semana" = $1, "updated_at" = $2 WHERE "horarios"."id" = $3  [["dia_semana", "#"], ["updated_at", "2016-03-26 22:41:28.568647"], ["id", 1]]

  def destroy
    @horario.destroy
---
DELETE FROM "horarios" WHERE "horarios"."id" = $1  [["id", 2]]

    def set_horario
      @horario = Horario.find(params[:id])
---
SELECT  "horarios".* FROM "horarios" WHERE "horarios"."id" = $1 LIMIT 1  [["id", 2]]