app/controllers/profissionals_controller.rb

INSERT INTO "profissionals" ("nome", "email", "telefone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", ""], ["email", ""], ["telefone", ""], ["created_at", "2016-03-26 21:37:05.535833"], ["updated_at", "2016-03-26 21:37:05.535833"]]
---
  def create
    @profissional = Profissional.new(profissional_params)

    if (current_user.tipo.eql? 2)
      @profissional.entidade_id = current_user.entidade_id
    end
    @profissional.status = 1

    respond_to do |format|
      if @profissional.save

SELECT  "profissionals".* FROM "profissionals" WHERE "profissionals"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_profissional
      @profissional = Profissional.find(params[:id])