app/controllers/profissional_servicos_controller.rb

INSERT INTO "profissional_servicos" ("profissional_id", "servico_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["profissional_id", 1], ["servico_id", 1], ["created_at", "2016-03-26 22:27:47.854992"], ["updated_at", "2016-03-26 22:27:47.854992"]]
---
  def create
    @profissional_servico = ProfissionalServico.new(profissional_servico_params)
    @profissionais = Profissional.where(entidade_id: current_user.entidade_id, status: 1)
    @lista_precos = ListaPreco.where(entidade_id: current_user.entidade_id, status: 1)

    @profissional_servico.entidade_id = current_user.entidade_id

    respond_to do |format|
      if @profissional_servico.save

SELECT  "profissional_servicos".* FROM "profissional_servicos" WHERE "profissional_servicos"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "profissional_servicos" WHERE "profissional_servicos"."id" = $1  [["id", 2]]
---
  def destroy
    respond_to do |format|
      @ps = ProfissionalServico.find(params[:id])
      @r = Reserva.where(lista_preco_id: @ps.lista_preco_id, profissional_id: @ps.profissional_id)
      if(@r.any?)
        format.html { redirect_to profissional_servicos_url, alert: 'Vinculo não pode ser excluido!' }
        format.json { head :no_content }
      else
        @profissional_servico.destroy

SELECT  "profissional_servicos".* FROM "profissional_servicos" WHERE "profissional_servicos"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_profissional_servico
      @profissional_servico = ProfissionalServico.find(params[:id])