app/controllers/ramos_controller.rb

  def index
    @ramos = Ramo.all
---
SELECT "ramos".* FROM "ramos"

  def create
    @ramo = Ramo.new(ramo_params)

    respond_to do |format|
      if @ramo.save
---
INSERT INTO "ramos" ("nome", "descricao", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "Cabelereiro"], ["descricao", "Corta cabelo"], ["created_at", "2016-03-26 20:36:46.316376"], ["updated_at", "2016-03-26 20:36:46.316376"]]

  def update
    respond_to do |format|
      if @ramo.update(ramo_params)
---
UPDATE "ramos" SET "nome" = $1, "descricao" = $2, "updated_at" = $3 WHERE "ramos"."id" = $4  [["nome", "Prestadora de serviço"], ["descricao", "Serviços em geral"], ["updated_at", "2016-03-27 01:39:35.588748"], ["id", 5]]

  def destroy
    respond_to do |format|
      @e = Entidade.where(ramo_id: params[:id])
      if(@e.any?)
        format.html { redirect_to ramos_url, alert: 'Ramo não pode ser excluido!' }
        format.json { head :no_content }
      else
        @ramo.destroy
---
DELETE FROM "ramos" WHERE "ramos"."id" = $1  [["id", 3]]

    def set_ramo
      @ramo = Ramo.find(params[:id])
---
SELECT  "ramos".* FROM "ramos" WHERE "ramos"."id" = $1 LIMIT 1  [["id", 3]]