app/controllers/servicos_controller.rb

SELECT "servicos".* FROM "servicos"
---
  def index
    @servicos = Servico.all

INSERT INTO "servicos" ("nome", "descricao", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", ""], ["descricao", ""], ["status", ""], ["created_at", "2016-03-26 18:24:54.846542"], ["updated_at", "2016-03-26 18:24:54.846542"]]
---
  def create
    @servico = Servico.new(servico_params)
    @servico.status = 1

    respond_to do |format|
      if @servico.save

SELECT  "servicos".* FROM "servicos" WHERE "servicos"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_servico
      @servico = Servico.find(params[:id])